IRP/src/Documents/OpeningEntry/OpeningEntry.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>OpeningEntry</name>
  <registerRecords>AccumulationRegister.PartnerArTransactions</registerRecords>

  <registerRecords>AccumulationRegister.R4010B_ActualStocks</registerRecords>
  <registerRecords>AccumulationRegister.Aging</registerRecords>
  <registerRecords>AccumulationRegister.R4011B_FreeStocks</registerRecords>
  <registerRecords>AccumulationRegister.AccountsStatement</registerRecords>

  <registerRecords>AccumulationRegister.ReconciliationStatement</registerRecords>
  <registerRecords>AccumulationRegister.AdvanceFromCustomers</registerRecords>
  <registerRecords>AccumulationRegister.AdvanceToSuppliers</registerRecords>
  <registerRecords>AccumulationRegister.PartnerApTransactions</registerRecords>
  <registerRecords>AccumulationRegister.AccountBalance</registerRecords>
  <registerRecords>AccumulationRegister.R4014B_SerialLotNumber</registerRecords>

  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AccountBalance</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>Account</name>
      <type>
        <types>CatalogRef.CashAccounts</types>
      </type>
    </attributes>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdvanceFromCustomers</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>Partner</name>
      <type>
        <types>CatalogRef.Partners</types>
      </type>
    </attributes>
    <attributes>
      <name>LegalName</name>
      <type>
        <types>CatalogRef.Companies</types>
      </type>
    </attributes>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdvanceToSuppliers</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>Partner</name>
      <type>
        <types>CatalogRef.Partners</types>
      </type>
    </attributes>
    <attributes>
      <name>LegalName</name>
      <type>
        <types>CatalogRef.Companies</types>
      </type>
    </attributes>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AccountPayableByAgreements</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>Partner</name>
      <type>
        <types>CatalogRef.Partners</types>
      </type>
    </attributes>
    <attributes>
      <name>LegalName</name>
      <type>
        <types>CatalogRef.Companies</types>
      </type>
    </attributes>
    <attributes>
      <name>Agreement</name>
      <type>
        <types>CatalogRef.Agreements</types>
      </type>
    </attributes>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AccountPayableByDocuments</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>Partner</name>
      <type>
        <types>CatalogRef.Partners</types>
      </type>
    </attributes>
    <attributes>
      <name>LegalName</name>
      <type>
        <types>CatalogRef.Companies</types>
      </type>
    </attributes>
    <attributes>
      <name>Agreement</name>
      <type>
        <types>CatalogRef.Agreements</types>
      </type>
    </attributes>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AccountReceivableByDocuments</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>Partner</name>
      <type>
        <types>CatalogRef.Partners</types>
      </type>
    </attributes>
    <attributes>
      <name>LegalName</name>
      <type>
        <types>CatalogRef.Companies</types>
      </type>
    </attributes>
    <attributes>
      <name>Agreement</name>
      <type>
        <types>CatalogRef.Agreements</types>
      </type>
    </attributes>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AccountReceivableByAgreements</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>Partner</name>
      <type>
        <types>CatalogRef.Partners</types>
      </type>
    </attributes>
    <attributes>
      <name>LegalName</name>
      <type>
        <types>CatalogRef.Companies</types>
      </type>
    </attributes>
    <attributes>
      <name>Agreement</name>
      <type>
        <types>CatalogRef.Agreements</types>
      </type>
    </attributes>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Inventory</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKey</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Store</name>
      <type>
        <types>CatalogRef.Stores</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>SerialLotNumber</name>
      <type>
        <types>CatalogRef.SerialLotNumbers</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Currencies</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyFrom</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Rate</name>
      <type>
        <types>DefinedType.typeCurrencyRate</types>
      </type>
    </attributes>
    <attributes>
      <name>ReverseRate</name>
      <type>
        <types>DefinedType.typeCurrencyRate</types>
      </type>
    </attributes>
    <attributes>
      <name>ShowReverseRate</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Multiplicity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MovementType</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>PaymentTerms</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>CalculationType</name>
      <type>
        <types>EnumRef.CalculationTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/Documents/OpeningEntry/ManagerModule.bsl
#Region Posting

Function PostingGetDocumentDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Tables = New Structure();
	QueryArray = GetQueryTextsSecondaryTables();
	PostingServer.ExecuteQuery(Ref, QueryArray, Parameters);
	Return Tables;
EndFunction

Function PostingGetLockDataSource(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	DocumentDataTables = Parameters.DocumentDataTables;
	DataMapWithLockFields = New Map();
	PostingServer.GetLockDataSource(DataMapWithLockFields, DocumentDataTables);
	Return DataMapWithLockFields;
EndFunction

Procedure PostingCheckBeforeWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Tables = Parameters.DocumentDataTables;	
	QueryArray = GetQueryTextsMasterTables();
	PostingServer.SetRegisters(Tables, Ref);
	PostingServer.FillPostingTables(Tables, Ref, QueryArray, Parameters);
EndProcedure

Function PostingGetPostingDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	PostingDataTables = New Map();
	
	PostingServer.SetPostingDataTables(PostingDataTables, Parameters);
	Return PostingDataTables;
EndFunction

Procedure PostingCheckAfterWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	CheckAfterWrite(Ref, Cancel, Parameters, AddInfo);
EndProcedure

#EndRegion

#Region Undoposting

Function UndopostingGetDocumentDataTables(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return PostingGetDocumentDataTables(Ref, Cancel, Undefined, Parameters, AddInfo);
EndFunction

Function UndopostingGetLockDataSource(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	DocumentDataTables = Parameters.DocumentDataTables;
	DataMapWithLockFields = New Map();
	Return DataMapWithLockFields;
EndFunction

Procedure UndopostingCheckBeforeWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return;
EndProcedure

Procedure UndopostingCheckAfterWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Parameters.Insert("Unposting", True);
	CheckAfterWrite(Ref, Cancel, Parameters, AddInfo);
EndProcedure

#EndRegion

#Region CheckAfterWrite

Procedure CheckAfterWrite(Ref, Cancel, Parameters, AddInfo = Undefined)
	CommonFunctionsClientServer.PutToAddInfo(AddInfo, "TableDataPath", "Object.Inventory");
EndProcedure

#EndRegion

#Region NewRegistersPosting

Function GetInformationAboutMovements(Ref) Export
	Str = New Structure;
	Str.Insert("QueryParamenters", GetAdditionalQueryParamenters(Ref));
	Str.Insert("QueryTextsMasterTables", GetQueryTextsMasterTables());
	Str.Insert("QueryTextsSecondaryTables", GetQueryTextsSecondaryTables());
	Return Str;
EndFunction

Function GetAdditionalQueryParamenters(Ref)
	StrParams = New Structure();
	StrParams.Insert("Ref", Ref);
	Return StrParams;
EndFunction

Function GetQueryTextsSecondaryTables()
	QueryArray = New Array;
	QueryArray.Add(ItemList());
	Return QueryArray;
EndFunction

Function GetQueryTextsMasterTables()
	QueryArray = New Array;
	QueryArray.Add(R4010B_ActualStocks());
	QueryArray.Add(R4011B_FreeStocks());
	QueryArray.Add(R4014B_SerialLotNumber());	
	Return QueryArray;
EndFunction

Function ItemList()
	Return
		"SELECT
		|	OpeningEntryInventory.Ref,
		|	OpeningEntryInventory.Key,
		|	OpeningEntryInventory.ItemKey,
		|	OpeningEntryInventory.Store,
		|	OpeningEntryInventory.Quantity,
		|	NOT OpeningEntryInventory.SerialLotNumber = VALUE(Catalog.SerialLotNumbers.EmptyRef) AS isSerialLotNumberSet,
		|	OpeningEntryInventory.SerialLotNumber,
		|	OpeningEntryInventory.Ref.Date AS Period,
		|	OpeningEntryInventory.Ref.Company AS Company
		|INTO ItemList
		|FROM
		|	Document.OpeningEntry.Inventory AS OpeningEntryInventory
		|WHERE
		|	OpeningEntryInventory.Ref = &Ref";
EndFunction

Function R4010B_ActualStocks()
	Return
		"SELECT 
		|	VALUE(AccumulationRecordType.Receipt) AS RecordType,
		|	*
		|INTO R4010B_ActualStocks
		|FROM
		|	ItemList AS QueryTable
		|WHERE 
		|	TRUE";

EndFunction

Function R4011B_FreeStocks()
	Return
		"SELECT 
		|	VALUE(AccumulationRecordType.Receipt) AS RecordType,
		|	*
		|INTO R4011B_FreeStocks
		|FROM
		|	ItemList AS QueryTable
		|WHERE
		|	TRUE";

EndFunction

Function R4014B_SerialLotNumber()
	Return
		"SELECT 
		|	VALUE(AccumulationRecordType.Receipt) AS RecordType,
		|	*
		|INTO R4014B_SerialLotNumber
		|FROM
		|	ItemList AS QueryTable
		|WHERE 
		|	QueryTable.isSerialLotNumberSet";

EndFunction

#EndRegion
